[{"url": "https://www.officems.co.za/", "text": "We have 30+ years' experience in the following Services:\nWe offer comprehensive bookkeeping services up to the Trial Balance stage and possess proficiency in most leading accounting software\nWe are a Registered Debt Collector, with a 100% success rate.\nWe provide customizable services designed to align with your unique business needs and goals.\nWe ensure timely submissions of VAT, PAYE, and UIF returns, maintaining strict compliance with all relevant deadlines.\nOur team brings years of expertise in payroll management.\nPersonalised Attention\nYou'll work with a dedicated team that takes the time to understand your business and deliver personalised support\nOur services are tailored to help you optimize both time and costs, while enhancing your overall profitability\nFriendly and professional support dedicated to delivering exceptional customer experiences.\nExpertise\nOur team possesses extens"}, {"url": "https://www.officems.co.za/", "text": "overall profitability\nFriendly and professional support dedicated to delivering exceptional customer experiences.\nExpertise\nOur team possesses extensive experience in delivering exceptional administrative support to businesses of all sizes. We secialize in implementing effective administrative systems that streamline operations, ensuring your business runs smoothly and professionally."}, {"url": "https://www.officems.co.za", "text": "We have 30+ years' experience in the following Services:\nWe offer comprehensive bookkeeping services up to the Trial Balance stage and possess proficiency in most leading accounting software\nWe are a Registered Debt Collector, with a 100% success rate.\nWe provide customizable services designed to align with your unique business needs and goals.\nWe ensure timely submissions of VAT, PAYE, and UIF returns, maintaining strict compliance with all relevant deadlines.\nOur team brings years of expertise in payroll management.\nPersonalised Attention\nYou'll work with a dedicated team that takes the time to understand your business and deliver personalised support\nOur services are tailored to help you optimize both time and costs, while enhancing your overall profitability\nFriendly and professional support dedicated to delivering exceptional customer experiences.\nExpertise\nOur team possesses extens"}, {"url": "https://www.officems.co.za", "text": "overall profitability\nFriendly and professional support dedicated to delivering exceptional customer experiences.\nExpertise\nOur team possesses extensive experience in delivering exceptional administrative support to businesses of all sizes. We secialize in implementing effective administrative systems that streamline operations, ensuring your business runs smoothly and professionally."}, {"url": "https://www.officems.co.za/debt-collection", "text": "Recover what is rightfully yours Effectively, Efficiently & Professionally debt collection pricing: We operate on a strict, no collection - no fee, basis You will only be invoiced once funds have been successfully recovered Our standard collection fee is 15% of recovered funds No collection = no charge"}, {"url": "https://www.officems.co.za/contact", "text": "Contact Us Get In Touch We are happy to assist with any enquiry Send Message Contact Information Pretoria, South Africa info@officems.co.za"}, {"url": "uploaded://office_info.pdf", "text": "O\u0002ice Savvy Administration Services – General inf or mation \n \nLorraine Esterhuizen is the founder of O\u0012ice Savvy Administration Services, a company \nthat specialises in making o\u0012ice management easy fo r small and entrepreneurial \nbusinesses.  Lorraine has over 40 years of experien ce in o\u0012ice management and helping \nentrepreneurs focus on their businesses and generat ing revenue, rather than dealing with \nthe myriads of administrative procedures, tasks and  red tape.  \n \nO\u0012ice Savvy Administration Services Based in Pretor ia, South Africa, we service clients \nnationally. We have developed an e\u0012icient system to  assist your business, no matter \nwhere you are based. \n \nContact details: \n \nLorraine’s contact details: Email info@o\u0012icems.co.za  and Website: www.O\u0012iceMS.co.za    \n \nMission: O\u0012ice Savvy Administration Services’ missi on and vision is to providing the \nhighest level of professi"}, {"url": "uploaded://office_info.pdf", "text": "and Website: www.O\u0012iceMS.co.za    \n \nMission: O\u0012ice Savvy Administration Services’ missi on and vision is to providing the \nhighest level of professional business support serv ices for your business, without \nbreaking the bank.  \n \nGeneral inf ormation:  \nWe understand and appreciate that you want to focus  on running your real  business, \nwithout having to worry about all the administratio n slowing you down.  \n \nO\u0012ice Savvy Administration Services prides itself o n our integrity, being timeous and also \nthe be ﬂexible and responsive to our clients changi ng needs. \n \nO\u0012ice Savvy Administration Services has extensive e xperience in accounting or \nbookkeeping systems, payroll, debtors collection, m anaging suppliers or creditors, \ncompiling accounting statement up to trial balance (ready for submission to auditors), \ndealing with VAT and VAT enquiries, submitting VAT returns, UIF Manage"}, {"url": "uploaded://office_info.pdf", "text": "g accounting statement up to trial balance (ready for submission to auditors), \ndealing with VAT and VAT enquiries, submitting VAT returns, UIF Management, \nCompensation Fund and submissions, sta\u0012 contracts, including disciplinary hearings \nand CCMA cases, local municipal taxes and related u tility management, pre-paid \nutilities, etc.  We can even assist building or mai ntenance contractors with setting up \nsafety ﬁles when needed. \n \nWe have knowledge of QuickBooks (desktop and cloud)  and Sage accounting software. \nWe are also ﬂexible to learn other software package s, including your business accounting \nsoftware. Please speak to us!  \n \nO\u0012ice Savvy Administration Services has extensive e xperience in the agricultural sector, \nbut speciﬁcally with farmers. We can assist farmers  with business planning, accounting, \nsta\u0012 contracts, payroll, general human resources ma nagement and disci"}, {"url": "uploaded://office_info.pdf", "text": "cally with farmers. We can assist farmers  with business planning, accounting, \nsta\u0012 contracts, payroll, general human resources ma nagement and disciplinary \nhearings.  \n \nPricing:  \nOur pricing philosophy is built around transparency  and predictability for your business. \nWe begin by conducting a thorough evaluation of you r speciﬁc business needs, taking \ntime to understand your operations, volume of trans actions, and administrative \nrequirements. This allows us to create a customised  service package that aligns perfectly \nwith your business. \n \nRather than charging unpredictable hourly rates, we o\ber straightforward ﬁxed monthly \npricing . This means you'll know exactly  what to budget for your administrative and \naccounting support, with no surprises on your month ly invoice. Our ﬁxed-fee approach \nhelps you maintain consistent cash ﬂow while ensuri ng you receive all the service"}, {"url": "uploaded://office_info.pdf", "text": "with no surprises on your month ly invoice. Our ﬁxed-fee approach \nhelps you maintain consistent cash ﬂow while ensuri ng you receive all the services your \nbusiness needs. \n \nWe structure our agreements in 6-month terms, provi ding stability while maintaining \nﬂexibility. Should your business require additional  services or face unexpected \nadministrative challenges, we're always ready to ac commodate special requests. Our \ngoal is to be a responsive partner who grows and ad apts with your business, ensuring you \nhave the support you need, when you need it. \n \nOnboarding process of  new clients: \nWhen you partner with us, Lorraine personally overs ees every aspect of the onboarding \nprocess to ensure a smooth transition and optimal r esults for your business. She begins \nwith an in-depth needs analysis, taking time to und erstand your unique business \noperations, challenges, and object"}, {"url": "uploaded://office_info.pdf", "text": "ts for your business. She begins \nwith an in-depth needs analysis, taking time to und erstand your unique business \noperations, challenges, and objectives. Drawing on her extensive experience in \naccounting, HR compliance, and administrative servi ces, Lorraine develops a tailored \nproject plan that outlines clear milestones, delive rables, and timelines. This practical, \nstructured approach ensures we address all your req uirements systematically while \nmaintaining focus on your desired outcomes. You'll have peace of mind knowing that your \nbusiness operations are in capable hands, with a cl ear roadmap to achieve your goals."}, {"url": "uploaded://brochure.pdf", "text": "Bookkeeping: We offer comprehensive bookkeeping services up to the Trial \nBalance stage and possess proficiency in most leading accounting software\nSARS submissions:  We ensure timely submissions of VAT, PAYE, and UIF \nreturns, maintaining strict compliance with all relevant deadlines.\nCost Effectiveness: Our services are tailored to help you optimize both time \nand costs, while enhancing your overall profitability\nDebt Collection: We are here to assist you in ensuring prompt payment from \nyour debtors.\nPayroll: Our team brings years of expertise in payroll management.\nCustomer Service: Friendly and professional support dedicated to delivering \nexceptional customer experiences.\nFlexibility: We provide customizable services designed to align with your \nunique business needs and goals\nPersonalised Attention: You'll work with a dedicated team that takes the time \nto understand your business"}, {"url": "uploaded://brochure.pdf", "text": "with your \nunique business needs and goals\nPersonalised Attention: You'll work with a dedicated team that takes the time \nto understand your business and deliver personalised support\nExpertise: Our team possesses extensive experience in delivering \nexceptional administrative support to businesses of all sizes."}]